In [14]:
import pandas as pd

data = {
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50]
}

df1 = pd.DataFrame(data)

In [15]:
df1

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [6]:
a=lambda x: x*2

In [7]:
df['A']=df['A'].apply(a)

In [8]:
df['A']

0     2
1     4
2     6
3     8
4    10
Name: A, dtype: int64

In [9]:
df

    A   B
0   2  10
1   4  20
2   6  30
3   8  40
4  10  50

In [10]:
import pandas as pd

data = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 32, 19]
}

df = pd.DataFrame(data)

df['AgeGroup'] = df['Age'].apply(lambda x: 'Young' if x < 30 else 'Adult')

print(df)

    Name  Age AgeGroup
0   John   25    Young
1  Alice   32    Adult
2    Bob   19    Young

In [11]:
df['Name'] = df['Name'].apply(lambda x: x.upper())

In [12]:
df

    Name  Age AgeGroup
0   JOHN   25    Young
1  ALICE   32    Adult
2    BOB   19    Young

In [16]:
df1['C'] = df1.apply(lambda row: row['A'] + row['B'], axis=1)

In [17]:
df1

   A   B   C
0  1  10  11
1  2  20  22
2  3  30  33
3  4  40  44
4  5  50  55

In [18]:
my_list = [1, 2, 2, 3, 4, 4, 5]

# Convert the list to a set
my_set = set(my_list)

print(my_set)

{1, 2, 3, 4, 5}